skasti/STM32F4xx/Src/main.c
/*

  main.c - driver code for STM32F4xx ARM processors

  Part of grblHAL

  Copyright (c) 2019-2021 Terje Io
  Some parts (C) COPYRIGHT STMicroelectronics - code created by IDE

  Grbl is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Grbl is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Grbl.  If not, see <http://www.gnu.org/licenses/>.

*/

#include "main.h"
#include "driver.h"
#include "grbl/grbllib.h"

static void SystemClock_Config (void);
static void MX_GPIO_Init (void);

int main(void)
{
    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
#ifdef HAS_BOOTLOADER
    HAL_RCC_DeInit();
    HAL_DeInit();
    extern uint8_t _FLASH_VectorTable;
    __disable_irq();
    SCB->VTOR = (uint32_t)&_FLASH_VectorTable;
    __DSB();
    __enable_irq();
#endif
    
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();

    grbl_enter();
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  __HAL_RCC_PWR_CLK_ENABLE();

#ifdef STM32F446xx

  #ifdef IS_FLEXI_CNC
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 15;
  RCC_OscInitStruct.PLL.PLLN = 216;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 8;
  RCC_OscInitStruct.PLL.PLLR = 2;

  #define APB1CLKDIV RCC_HCLK_DIV4
  #define APB2CLKDIV RCC_HCLK_DIV2

  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  } 

    #define FLASH_LATENCY FLASH_LATENCY_5

  #elif NUCLEO_F446

    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    RCC_OscInitTypeDef RCC_OscInitStruct = {
#if RTC_ENABLE
        .OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_LSE,
        .LSEState       = RCC_LSE_ON,
#else
        .OscillatorType = RCC_OSCILLATORTYPE_HSI,
#endif
        .HSIState = RCC_HSI_ON,
        .HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT,
        .PLL.PLLState = RCC_PLL_ON,
        .PLL.PLLSource = RCC_PLLSOURCE_HSI,
        .PLL.PLLM = 16,
        .PLL.PLLN = 360,
        .PLL.PLLP = RCC_PLLP_DIV2,
        .PLL.PLLQ = 2,
        .PLL.PLLR = 2
    };

    #define APB1CLKDIV RCC_HCLK_DIV4
    #define APB2CLKDIV RCC_HCLK_DIV2
    #define FLASH_LATENCY FLASH_LATENCY_5

  #elif defined(BOARD_FYSETC_S6)

    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
    RCC_OscInitTypeDef RCC_OscInitStruct = {
        .OscillatorType = RCC_OSCILLATORTYPE_HSE,
        .HSEState = RCC_HSE_ON,
        .PLL.PLLState = RCC_PLL_ON,
        .PLL.PLLSource = RCC_PLLSOURCE_HSE,
        .PLL.PLLM = 12, // Input clock divider (12MHz crystal) = Base clock 1MHz
        .PLL.PLLN = 336, // Main clock multiplier
        .PLL.PLLP = 2, // Main clock divider = Main clock 168MHz
        .PLL.PLLQ = 7, // Special peripheral (USB) clock divider (relative to main clock multiplier) = USB clock 48MHz
        .PLL.PLLR = 2
    };

    #define APB1CLKDIV RCC_HCLK_DIV2
    #define APB2CLKDIV RCC_HCLK_DIV1
    #define FLASH_LATENCY FLASH_LATENCY_5

  #else

    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    RCC_OscInitTypeDef RCC_OscInitStruct = {
        .OscillatorType = RCC_OSCILLATORTYPE_HSE,
        .HSEState = RCC_HSE_ON,
        .PLL.PLLState = RCC_PLL_ON,
        .PLL.PLLSource = RCC_PLLSOURCE_HSE,
  #if HSE_VALUE == 8000000
        .PLL.PLLM = 7,
        .PLL.PLLN = 294,
        .PLL.PLLP = RCC_PLLP_DIV2,
        .PLL.PLLQ = 7,
        .PLL.PLLR = 7
  #else
        .PLL.PLLM = (uint32_t)HSE_VALUE / 1000000UL,
        .PLL.PLLN = 336,
        .PLL.PLLP = RCC_PLLP_DIV2,
        .PLL.PLLQ = 2,
        .PLL.PLLR = 2
  #endif
    };

    #define APB1CLKDIV RCC_HCLK_DIV4
    #define APB2CLKDIV RCC_HCLK_DIV2
    #define FLASH_LATENCY FLASH_LATENCY_5

  #endif

#elif defined(STM32F411xE)

  /** Configure the main internal regulator output voltage  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  #ifdef NUCLEO_F411

    RCC_OscInitTypeDef RCC_OscInitStruct = {
#if RTC_ENABLE
        .OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_LSE,
        .LSEState       = RCC_LSE_ON,
#else
        .OscillatorType = RCC_OSCILLATORTYPE_HSI,
#endif
        .HSIState = RCC_HSI_ON,
        .HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT,
        .PLL.PLLState = RCC_PLL_ON,
        .PLL.PLLSource = RCC_PLLSOURCE_HSI,
        .PLL.PLLM = 16,
        .PLL.PLLN = 336,
        .PLL.PLLP = RCC_PLLP_DIV4,
        .PLL.PLLQ = 4
    };

    #define FLASH_LATENCY FLASH_LATENCY_2

  #else // BlackPill

    RCC_OscInitTypeDef RCC_OscInitStruct = {
        .OscillatorType = RCC_OSCILLATORTYPE_HSE,
        .HSEState = RCC_HSE_ON,
        .PLL.PLLState = RCC_PLL_ON,
        .PLL.PLLSource = RCC_PLLSOURCE_HSE,
        .PLL.PLLM = (uint32_t)HSE_VALUE / 1000000UL,
        .PLL.PLLN = 192,
        .PLL.PLLP = RCC_PLLP_DIV2,
        .PLL.PLLQ = 4
    };

    #define FLASH_LATENCY FLASH_LATENCY_3

  #endif

#elif defined(STM32F407xx)

    /** Configure the main internal regulator output voltage  */
   __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    RCC_OscInitTypeDef RCC_OscInitStruct = {
        .OscillatorType = RCC_OSCILLATORTYPE_HSE,
        .HSEState = RCC_HSE_ON,
        .PLL.PLLState = RCC_PLL_ON,
        .PLL.PLLSource = RCC_PLLSOURCE_HSE,
        .PLL.PLLM = (uint32_t)HSE_VALUE / 1000000UL,
        .PLL.PLLN = 336,
        .PLL.PLLP = RCC_PLLP_DIV2,
        .PLL.PLLQ = 7
    };

    #define APB1CLKDIV RCC_HCLK_DIV4
    #define APB2CLKDIV RCC_HCLK_DIV2
    #define FLASH_LATENCY FLASH_LATENCY_5

#else // STM32F401

    /** Configure the main internal regulator output voltage  */
   __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

  #ifdef NUCLEO_F401

    RCC_OscInitTypeDef RCC_OscInitStruct = {
#if RTC_ENABLE
        .OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_LSE,
        .LSEState       = RCC_LSE_ON,
#else
        .OscillatorType = RCC_OSCILLATORTYPE_HSI,
#endif
        .HSIState = RCC_HSI_ON,
        .HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT,
        .PLL.PLLState = RCC_PLL_ON,
        .PLL.PLLSource = RCC_PLLSOURCE_HSI,
        .PLL.PLLM = 16,
        .PLL.PLLN = 336,
        .PLL.PLLP = RCC_PLLP_DIV4,
        .PLL.PLLQ = 4
    };

  #else

    RCC_OscInitTypeDef RCC_OscInitStruct = {
        .OscillatorType = RCC_OSCILLATORTYPE_HSE,
        .HSEState = RCC_HSE_ON,
        .PLL.PLLState = RCC_PLL_ON,
        .PLL.PLLSource = RCC_PLLSOURCE_HSE,
        .PLL.PLLM = (uint32_t)HSE_VALUE / 1000000UL,
        .PLL.PLLN = 336,
        .PLL.PLLP = RCC_PLLP_DIV4,
        .PLL.PLLQ = 7
    };

  #endif

    #define FLASH_LATENCY FLASH_LATENCY_2

#endif

  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

#ifndef APB1CLKDIV
#define APB1CLKDIV RCC_HCLK_DIV2
#endif
#ifndef APB2CLKDIV
#define APB2CLKDIV RCC_HCLK_DIV1
#endif

  /** Initializes the CPU, AHB and APB busses clocks */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = APB1CLKDIV;
  RCC_ClkInitStruct.APB2CLKDivider = APB2CLKDIV;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY) != HAL_OK)
  {
    Error_Handler();
  }

#if USB_SERIAL_CDC && defined(STM32F446xx)

  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CLK48;

  #if defined(BOARD_MY_MACHINE) || defined(BOARD_FLEXI_HAL)
  
    PeriphClkInitStruct.PLLSAI.PLLSAIM = 25;
    PeriphClkInitStruct.PLLSAI.PLLSAIN = 192;
    PeriphClkInitStruct.PLLSAI.PLLSAIQ = 2;
    PeriphClkInitStruct.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV4;
    PeriphClkInitStruct.PLLSAIDivQ = 1;
    PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48CLKSOURCE_PLLSAIP;

  #else    
    PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48CLKSOURCE_PLLQ;
  #endif
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  __HAL_RCC_USB_OTG_FS_CLK_ENABLE();

#endif
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
#ifdef GPIOF
  __HAL_RCC_GPIOF_CLK_ENABLE();
#endif
#ifdef GPIOG
  __HAL_RCC_GPIOG_CLK_ENABLE();
#endif
#ifdef GPIOH
  __HAL_RCC_GPIOH_CLK_ENABLE();
#endif
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

